export default [
  {
    type: "mc",
    question: "ใครคือบิดาแห่งเศรษฐศาสตร์",
    choices: [
      "จอห์น เมนาร์ด เคนส์",
      "อดัม สมิธ",
      "อัลเฟรด มาร์แชลล์",
      "พอล แซมมวลสัน"
    ],
    answer: 1,
    answerExplanation: [
      "เคนส์ได้รับการยกย่องว่าเป็นบิดาแห่งเศรษฐศาสตร์มหภาค เนื่องจากเขาเป็นผู้ริเริ่มเศรษฐศาสตร์มหภาคเป็นคนแรก",
      "อดัม สมิธ เป็นนักเศรษฐศาสตร์ผู้บุกเบิก ได้รับการยากย่องให้เป็นบิดาทางเศรษฐศาสตร์เนื่องจากเขียนหนังสือ การสอบสวนธรรมชาติและสาเหตุแห่งความมั่งคั่งของประชาชาติ (An Inquiry Into the Nature and Causes of the Wealth of Nations) ซึ่งเป็นตำราทางเศรษฐศาสตร์เล่มแรกของโลก",
      "มาร์แชลล์ได้รับการยกย่องว่าเป็นบิดาแห่งเศรษฐศาสตร์จุลภาค เนื่องจากเขียนหนังสือ บัญญัติ 10 ประการทางเศรษฐศาสตร์ (Principles of Economics) ซึ่งเป็นตำราเศรษฐศาสตร์จุลภาคเล่มแรกของโลก",
      "แซมมวลสัน เป็นนักเศรษฐศาสตร์ชาวอเมริกันที่นิยามความหายของคำว่าเศรษฐศาสตร์"
    ],
    topics: ["นักเศรษฐศาสตร์", "ความรู้เบื้องต้นทางเศรษฐศาสตร์", "เศรษฐศาสตร์"],
    bookmark: false
  },
  {
    type: "mc",
    question: "สัตว์ป่าจัดเป็นปัจจัยการผลิตประเภทใด",
    choices: ["ที่ดิน", "แรงงาน", "ทุน", "เจ้าของกิจการ"],
    answer: 0,
    answerExplanation: [
      "นอกจากที่ดินจะหมายที่ที่ตั้งของอาคารและสถานที่แล้ว ที่ดินยังหมายถึงทรัพยากรธรรมชาติด้วย สัตว์ป่าเป็นทรัพยากรธรรมชาติจึงจัดอยู่ในประเภทของที่ดิน",
      "แรงงานหมายถึงแรงกายและปัญญาของมนุษย์เท่านั้น แม้ว่าจะมีการนำสัตว์ป่ามาเป็นแรงงาน แต่สัตว์ป่าไม่ใช่มนุษย์ สัตว์ป่าจึงไม่จัดอยู่ในแรงงาน",
      "ทุนคือสิ่งที่นำมาใช้เป็นเครื่องมือในการผลิต สัตว์ที่ใช้แรงงาน เช่น ช้าง ม้า วัว ควาย ที่นำมาใช้เป็นเครื่องมือในการผลิตจะนับอยู่ในประเภทของทุน ไม่ใช่ที่ดิน",
      "เจ้าของกิจการคือผู้ที่นำปัจจัยการผลิตทั้งที่ดิน ทุน แรงงาน มาก่อให้เกิดการผลิต สัตว์ป่าจึงไม่ใช่เจ้าของกิจการ"
    ],
    topics: ["ปัจจัยการผลิต", "ความรู้เบื้องต้นทางเศรษฐศาสตร์", "เศรษฐศาสตร์"],
    bookmark: false
  },
  {
    type: 'mc',
    question: 'หน่วยเศรษฐกิจใดในระบบเศรษฐกิจที่นำปัจจัยการผลิตมาผลิตสินค้าและบริการ',
    choices: ['รัฐบาล', 'ครัวเรือน', 'ธนาคาร', 'ธุรกิจ'],
    answer: 3,
    answerExplanation: [' รัฐบาลเป็นผู้บริโภคและเจ้าของปัจจัยการผลิต แต่ไม่ใช่ผู้ที่นำปัจจัยการผลิตมาทำเป็นสินค้าและบริการ',
    'ครัวเรือนเป็นหนึ่งในปัจจัยการผลิตผ่านการเป็นแรงงาน และเป็นหน่วยที่จ่ายเงินเพื่อให้ได้สินค้าและบริการจากหน่วยธุรกิจมา เช่น นาย ก (จากหน่วบครัวเรือน) ซื้อของจากร้านสะดวกซื้อ (หน่วยธุรกิจ) และนาย ก สามารถรับจ้างเป็นพนักงานในร้านสะดวกซื้อได้',
    'ธนาคารเป็นสถาบันทางการเงิน ไม่นับว่าเป็นหน่วยเศรษฐกิจ เนื่องจากหน่วยเศรษฐกิจคือเพียง 3 หน่วยคือ ครัวเรือน ธุรกิจ และรัฐบาลเท่านั้น',
    'ธุรกิจคือบุคคลหรือกลุ่มคนที่นำปัจจัยการผลิตมาผลิตสินค้าและบริการ แล้วนำไปขายให้กับครัวเรือน ธุรกิจด้วยกันเอง และรัฐบาล เช่น ร้านสับปะรด (หน่วยธุรกิจ) ขายคอมพิวเตอร์ให้กับนาย ก (หน่วยครัวเรือน) หรือขายให้กับรัฐบาล (หน่วยรัฐบาล) นำไปใช้ในสำนักงาน เป็นต้น'],
    topics: ['ปัจจัยการผลิต', 'หน่วยเศรษฐกิจ', 'ความรู้เบื้องต้นทางเศรษฐศาสตร์','เศรษฐศาสตร์'],
    bookmark: false
    },
    {
        type: 'mc',
        question: 'ระบบเศษฐกิจแบบใดที่มีการแข่งขันด้านคุณภาพ ประสิทธิภาพ และการบริการอย่างเสรี โดยมีกฎหมายรับรอง',
        choices: ['ระบบสังคมนิยม', 'ระบบเศรษฐกิจแบบผสม', 'ระบบทุนนิยมหรือเสรีนิยม', 'ระบบคอมมิวนิสต์'],
        answer: 2,
        answerExplanation: ['ระบบสังคมนิยมมีรัฐบาลเป็นเจ้าของปัจจัยการผลิต จัดสรรงบประมาณมาทำธุรกิจ ซึ่งมักจะขาดทุนและคุณภาพต่ำ',
        'ระบบเศรษฐกิจแบบผสมคือการนำข้อดีของระบบทุนนิยมกับสังคมนิยมมาผสมกัน ถึงแม้ว่ารัฐบาลไม่จำกัดเรื่องการเป็นเจ้าของปัจจัยการผลิต แต่มีการจำกัดกลไกราคา ทำให้การแข่งขันยังถูกจำกัดเสรีภาพอยู่บ้าง',
        'ระบบทุนนิยมหรือเสรีนิยม เอกชนมีเสรีภาพในการเป็นเจ้าของปัจจัยการผลิตเหมือนระบบผสม ทำให้เกิดการแข่งขันในตลาด ราคาสินค้าเป็นไปตามกลไกตลาด ส่งผลให้เอกชนต้องแข่งขันกันผลิตสินค้าให้มีประสิทธิภาพและราคาถูก',
        'ระบบคอมมิวนิสต์เป็นเจ้าของปัจจัยการผลิตและทำกิจกรรมทางเศรษฐกิจเองทั้งหมด ทำให้ไม่มีคู่แข่ง ส่งผลให้มีสินค้าและบริการน้อยและสินค้าด้อยคุณภาพ'],
        topics: ['ระบบเศรษฐกิจ', 'ความรู้เบื้องต้นทางเศรษฐศาสตร์','เศรษฐศาสตร์'],
        bookmark: false
    },
    {
        type: 'mc',
        question: 'ข้อใดไม่ใช่ข้อเสียของระบบทุนนิยม',
        choices: ['รายได้ส่วนใหญ่ตกแก่นายทุนและการกระจายรายได้ไม่ดี', 'นายทุนรวมตัวกันขายสินค้าราคาแพง', 'เกิดการใช้ทรัพยากรธรรมชาติอย่างฟุ่มเฟือย', 'เอกชนไม่มีเสรีภาพทางเศรษฐกิจ'],
        answer: 3,
        answerExplanation: ['ในระบบทุนนิยม นายทุนมีรายได้มหาศาลมาจากการจ่ายค่าจ้างราคาต่ำ เพื่อนำมาลงทุนขยายธุรกิจต่อไป เช่น นาย ข เปิดร้านขายขนมปัง ในฐานะเจ้าของกิจการ นาย ข ต้องการกำไรที่สูงที่สุด จึงทำให้แรงงานของตัวเองได้รับค่าจ้างในราคาที่ต่ำลง เพื่อนำเงินส่วนนั้นมาเป็นกำไรของตัวเอง เมื่อแรงงานได้เงินน้อยลง แรงงานจึงมีเงินไปใช้จ่ายในชีวิตประจำวันน้อยลง ทำให้เงินหมุนเวียนในระบบน้อยลง หรือเรียกว่าการกระจายรายได้ไม่ดี',
        ' ถ้าสินค้าในตลาดนั้นมีผู้ผลิตน้อยราย ผู้ผลิตสินค้าอาจจะรวมตัวกันมาพูดคุยกันว่าจะขึ้นราคาสินค้านั้นพร้อมกัน ทำให้สินค้ามีราคาแพง เช่น ผู้ประกอบการบริษัทมือถือในประเทศ A มีเพียง 3 ราย แล้วทั้ง 3 คนตกลงกันว่าจะขึ้นราคาค่าโทรศัทพ์พร้อมกัน ทำให้ผู้บริโภทต้องจ่ายค่าโทรศัพท์แพงขึ้น เพราะไม่จำเป็นต้องแข่งกันผู้ประกอบการรายอื่นที่ทำให้ราคาค่าโทรศัทพ์ถูกลงจนลูกค้าหันมาใช้ผลิตภัณฑ์ของบริษัทนั้น',
        'เนื่องจากระบบทุนนิยมเอื้อให้ผู้ผลิตสามารถนำปัจจัยการผลิตมาผลิตสินค้าได้อย่างเสรี ทำให้ผู้ประกอบการนำปัจจัยการผลิตมาใช้มากขึ้น ส่งผลให้เกิดการใช้ทรัพยากรอย่างฟุ่มเฟือยและสิ่งแวดล้อมเสื่อมโทรม เช่น ผู้ประกอบการเฟอร์นิเจอร์หลายรายต้องการผลิตโซฟาไม้แข่งกัน ผู้ผลิตจำเป็นต้องตัดต้นไม้ เพื่อนำมาทำโซฟาไม้สำหรับจำหน่าย ทำให้สูญเสียต้นไม้และสิ่งแวดล้อมเสื่อมโทรมลง',
        'ระบบทุนนิยมให้เสรีภาพกับเอกชนอย่างเต็มที่ แต่ระบบคอมมิวนิสต์จะจำกัดเสรีภาพทางเศรษฐกิจของเอกชน เนื่องจากรัฐบาลเป็นผู้ดำเนินกิจกรรมทางเศรษฐกิจทั้งหมดเอง'],
        topics: ['ระบบเศรษฐกิจ', 'ความรู้เบื้องต้นทางเศรษฐศาสตร์','เศรษฐศาสตร์'],
        bookmark: false
        },
        
        
];
